# Content
* Min Max
* Binary
* Binning (Discretization) 
* Standardize
* Square / cube root 
* Log and Exp
* One-hot encoding
* 0-1

In [2]:
import numpy as np
import pandas as pd

### Lets import a data file to work in it

In [44]:
data = pd.read_csv('Churn_Modelling.csv')
df = data.copy()
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [45]:
df.dtypes

RowNumber            int64
CustomerId           int64
Surname             object
CreditScore          int64
Geography           object
Gender              object
Age                  int64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
Exited               int64
dtype: object

In [46]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

### Min-Max transformation on Age

In [47]:
df['Age'] = (df['Age'] - df['Age'].min())/(df['Age'].max() - df['Age'].min())
df['Age']

0       0.324324
1       0.310811
2       0.324324
3       0.283784
4       0.337838
          ...
9995    0.283784
9996    0.229730
9997    0.243243
9998    0.324324
9999    0.135135
Name: Age, Length: 10000, dtype: float64

In [48]:
df['Balance'].value_counts()

0.00         3617
105473.74       2
130170.82       2
72594.00        1
139723.90       1
             ...
130306.49       1
92895.56        1
132005.77       1
166287.85       1
104001.38       1
Name: Balance, Length: 6382, dtype: int64

In [49]:
df['Balance'] = (df['Balance'] - df['Balance'].min()) / (df['Balance'].max() - df['Balance'].min() )

In [50]:
df['Balance'].value_counts()

0.000000    3617
0.420385       2
0.518819       2
0.620109       1
0.580917       1
            ...
0.758471       1
0.271578       1
0.567564       1
0.258305       1
0.513240       1
Name: Balance, Length: 6382, dtype: int64

In [51]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,0.324324,2,0.000000,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,0.310811,1,0.334031,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,0.324324,8,0.636357,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,0.283784,1,0.000000,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,0.337838,2,0.500246,1,1,1,79084.10,0

### Binarize on credit score

In [53]:
df['CreditScore'].describe()

count    10000.000000
mean       650.528800
std         96.653299
min        350.000000
25%        584.000000
50%        652.000000
75%        718.000000
max        850.000000
Name: CreditScore, dtype: float64

In [99]:
y = pd.Series([5,2,3,8,9,1])
print(y)
y[y>5]

0    5
1    2
2    3
3    8
4    9
5    1
dtype: int64

3    8
4    9
dtype: int64

In [58]:
df.shape #[0]

(10000, 14)

In [63]:
np.repeat([0,1,2],2) #,df.shape[0])

array([0, 0, 1, 1, 2, 2])

In [66]:
x = df['CreditScore']
CS_cat = np.repeat(0,df.shape[0])
CS_cat[x > x.median()] = 1

In [81]:
print(x[:5])
print('-'*80)
print(CS_cat[:5])
print('-'*80)
print(x.median())

0    619
1    608
2    502
3    699
4    850
Name: CreditScore, dtype: int64
--------------------------------------------------------------------------------
[0 0 0 1 1]
--------------------------------------------------------------------------------
652.0

In [100]:
y[y>6] = 'A'
y

0    5
1    2
2    3
3    A
4    A
5    1
dtype: object

### Binning Balance

In [105]:
print(df['Balance'].describe())
np.quantile(df['Balance'],0.5)

count    10000.000000
mean         0.304848
std          0.248696
min          0.000000
25%          0.000000
50%          0.387402
75%          0.508749
max          1.000000
Name: Balance, dtype: float64

0.3874024708597822

In [106]:
X = df['Balance']
Bal_bins = np.repeat('Poor',df.shape[0])
Bal_bins[(X > np.quantile(X,0.25)) & (X <= np.quantile(X,0.75))] = 'Avg'
Bal_bins[X > np.quantile(X,0.75)] = 'Best'
print(X.values[:10])
print(Bal_bins[:10])

[0.         0.33403148 0.63635718 0.         0.50024622 0.45339436
 0.         0.45853972 0.56617039 0.53648826]
['Poor' 'Avg' 'Best' 'Poor' 'Avg' 'Avg' 'Poor' 'Avg' 'Best' 'Best']

In [107]:
Bal_bins = pd.Series(Bal_bins)
Bal_bins.value_counts()

Avg     3883
Poor    3617
Best    2500
dtype: int64

### Standardise EstimatedSalary

In [109]:
df.EstimatedSalary.describe()

count     10000.000000
mean     100090.239881
std       57510.492818
min          11.580000
25%       51002.110000
50%      100193.915000
75%      149388.247500
max      199992.480000
Name: EstimatedSalary, dtype: float64

In [113]:
std_est_sal = (df['EstimatedSalary'] - df['EstimatedSalary'].mean()) / df['EstimatedSalary'].std()
std_est_sal

0       0.021885
1       0.216523
2       0.240675
3      -0.108912
4      -0.365258
          ...
9995   -0.066416
9996    0.027987
9997   -1.008593
9998   -0.125224
9999   -1.076316
Name: EstimatedSalary, Length: 10000, dtype: float64

In [120]:
df['CreditScore'] = df['CreditScore']**(1/3)
df['CreditScore'].head()

0    8.522432
1    8.471647
2    7.947574
3    8.874810
4    9.472682
Name: CreditScore, dtype: float64

In [124]:
df['CreditScore'] = np.log(df['CreditScore'])
df['CreditScore'].head()

0    2.142702
1    2.136725
2    2.072867
3    2.183217
4    2.248412
Name: CreditScore, dtype: float64

In [128]:
np.log(100000)

11.512925464970229

In [134]:
np.exp(10)

22026.465794806718

In [136]:
df['CreditScore'] = np.exp(df['CreditScore'])
df['CreditScore'].head()

0    8.522432
1    8.471647
2    7.947574
3    8.874810
4    9.472682
Name: CreditScore, dtype: float64

In [141]:
print(df.dtypes)
num = df.columns[df.dtypes != 'object']
print(num)

RowNumber            int64
CustomerId           int64
Surname             object
CreditScore        float64
Geography           object
Gender              object
Age                float64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
Exited               int64
dtype: object
Index(['RowNumber', 'CustomerId', 'CreditScore', 'Age', 'Tenure', 'Balance',
       'NumOfProducts', 'HasCrCard', 'IsActiveMember', 'EstimatedSalary',
       'Exited'],
      dtype='object')

In [144]:
d_num = df[num]
d_num.head()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,8.522432,0.324324,2,0.000000,1,1,1,101348.88,1
1,2,15647311,8.471647,0.310811,1,0.334031,1,0,1,112542.58,0
2,3,15619304,7.947574,0.324324,8,0.636357,3,1,0,113931.57,1
3,4,15701354,8.874810,0.283784,1,0.000000,2,0,0,93826.63,0
4,5,15737888,9.472682,0.337838,2,0.500246,1,1,1,79084.10,0

In [151]:
cat = df.columns[df.dtypes == 'object']
cat_data = df[cat]
cat_data.head()

    Surname Geography  Gender
0  Hargrave    France  Female
1      Hill     Spain  Female
2      Onio    France  Female
3      Boni    France  Female
4  Mitchell     Spain  Female

In [152]:
#Surname not required
del cat_data['Surname']

In [153]:
cat_data

     Geography  Gender
0       France  Female
1        Spain  Female
2       France  Female
3       France  Female
4        Spain  Female
...        ...     ...
9995    France    Male
9996    France    Male
9997    France  Female
9998   Germany    Male
9999    France  Female

[10000 rows x 2 columns]

### One-hot encoding

In [157]:
cat_data_ohe = pd.get_dummies(cat_data,columns = ['Geography','Gender'], drop_first=True)
cat_data_ohe

      Geography_Germany  Geography_Spain  Gender_Male
0                     0                0            0
1                     0                1            0
2                     0                0            0
3                     0                0            0
4                     0                1            0
...                 ...              ...          ...
9995                  0                0            1
9996                  0                0            1
9997                  0                0            0
9998                  1                0            1
9999                  0                0            0

[10000 rows x 3 columns]

In [176]:
# Categorical to numeric coding
cat_data.dtypes

Geography    int8
Gender       int8
dtype: object

In [177]:
#Converting 'object' to 'category'
cat_data = cat_data.astype('category')
cat_data.dtypes

Geography    category
Gender       category
dtype: object

In [178]:
cat_data['Gender'][0:10].cat.codes

0    0
1    0
2    0
3    0
4    0
5    1
6    1
7    0
8    1
9    1
dtype: int8

In [179]:
for i in cat_data.columns:
    print(i)
    cat_data[i] = cat_data[i].cat.codes
cat_data.head()

Geography
Gender

   Geography  Gender
0          0       0
1          2       0
2          0       0
3          0       0
4          2       0

In [182]:
df1 = d_num.join(cat_data_ohe,how = 'outer')
df1.head()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_Germany,Geography_Spain,Gender_Male
0,1,15634602,8.522432,0.324324,2,0.000000,1,1,1,101348.88,1,0,0,0
1,2,15647311,8.471647,0.310811,1,0.334031,1,0,1,112542.58,0,0,1,0
2,3,15619304,7.947574,0.324324,8,0.636357,3,1,0,113931.57,1,0,0,0
3,4,15701354,8.874810,0.283784,1,0.000000,2,0,0,93826.63,0,0,0,0
4,5,15737888,9.472682,0.337838,2,0.500246,1,1,1,79084.10,0,0,1,0

In [191]:
df2 = pd.merge(d_num, cat_data, on = d_num.index)
df2

,key_0,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography,Gender
0,0,1,15634602,8.522432,0.324324,2,0.000000,1,1,1,101348.88,1,0,0
1,1,2,15647311,8.471647,0.310811,1,0.334031,1,0,1,112542.58,0,2,0
2,2,3,15619304,7.947574,0.324324,8,0.636357,3,1,0,113931.57,1,0,0
3,3,4,15701354,8.874810,0.283784,1,0.000000,2,0,0,93826.63,0,0,0
4,4,5,15737888,9.472682,0.337838,2,0.500246,1,1,1,79084.10,0,2,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9995,9996,15606229,9.169623,0.283784,5,0.000000,2,1,0,96270.64,0,0,1
9996,9996,9997,15569892,8.020779,0.229730,10,0.228657,1,1,1,101699.77,0,0,1
9997,9997,9998,15584532,8.916931,0.243243,7,0.000000,1,0,1,42085.58,1,0,0
9998,9998,9999,15682355,9.173585,0.324324,3,0.299226,2,1,0,92888.52,1,1,1
9999,9999,10000,15628319,9.252130,0.135135,4,0.518708,1,1,0,38190.78,0,0,0

In [ ]:
df1.to_csv('Cleaned_data_churn.csv')